yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/rtc_reg.h
    __IO uint32_t FREQADJ;               /*!< [0x0008] RTC Frequency Compensation Register                              */
    __IO uint32_t TIME;                  /*!< [0x000c] RTC Time Counter Register                                        */
    __IO uint32_t CAL;                   /*!< [0x0010] RTC Calendar Counter Register                                    */
    __IO uint32_t TIMEFMT;               /*!< [0x0014] RTC Time Format Selection Register                               */
    __IO uint32_t WEEKDAY;               /*!< [0x0018] RTC Day of the Week Register                                     */
    __IO uint32_t TALM;                  /*!< [0x001c] RTC Time Alarm Register                                          */
    __IO uint32_t CALM;                  /*!< [0x0020] RTC Calendar Alarm Register                                      */
    __I  uint32_t LEAPYEAR;              /*!< [0x0024] RTC Leap Year Indicator Register                                 */
    __IO uint32_t INTEN;                 /*!< [0x0028] RTC Interrupt Enable Register                                    */
    __IO uint32_t INTSTS;                /*!< [0x002c] RTC Interrupt Status Register                                    */
    __IO uint32_t TICK;                  /*!< [0x0030] RTC Time Tick Register                                           */
    __IO uint32_t PWRCTL;                /*!< [0x0034] RTC Power Control Register                                       */
    __I  uint32_t PWRCNT;                /*!< [0x0038] RTC Power Control Counter Register                               */
    __IO uint32_t CLKCTL;                /*!< [0x003c] RTC 32.768 kHz Clock Control Register                            */
    __IO uint32_t SPR0;                  /*!< [0x0040] RTC Spare Register 0                                             */
    __IO uint32_t SPR1;                  /*!< [0x0044] RTC Spare Register 1                                             */
    __IO uint32_t SPR2;                  /*!< [0x0048] RTC Spare Register 2                                             */
    __IO uint32_t SPR3;                  /*!< [0x004c] RTC Spare Register 3                                             */
    __IO uint32_t SPR4;                  /*!< [0x0050] RTC Spare Register 4                                             */
    __IO uint32_t SPR5;                  /*!< [0x0054] RTC Spare Register 5                                             */
    __IO uint32_t SPR6;                  /*!< [0x0058] RTC Spare Register 6                                             */
    __IO uint32_t SPR7;                  /*!< [0x005c] RTC Spare Register 7                                             */
    __IO uint32_t SPR8;                  /*!< [0x0060] RTC Spare Register 8                                             */
    __IO uint32_t SPR9;                  /*!< [0x0064] RTC Spare Register 9                                             */
    __IO uint32_t SPR10;                 /*!< [0x0068] RTC Spare Register 10                                            */
    __IO uint32_t SPR11;                 /*!< [0x006c] RTC Spare Register 11                                            */
    __IO uint32_t SPR12;                 /*!< [0x0070] RTC Spare Register 12                                            */
    __IO uint32_t SPR13;                 /*!< [0x0074] RTC Spare Register 13                                            */
    __IO uint32_t SPR14;                 /*!< [0x0078] RTC Spare Register 14                                            */
    __IO uint32_t SPR15;                 /*!< [0x007c] RTC Spare Register 15                                            */

} RTC_T;

/**
    @addtogroup RTC_CONST RTC Bit Field Definition
    Constant Definitions for RTC Controller
@{ */

#define RTC_INIT_Active_Pos              (0)                                               /*!< RTC_T::INIT: Active Position           */
#define RTC_INIT_Active_Msk              (0x1ul << RTC_INIT_Active_Pos)                    /*!< RTC_T::INIT: Active Mask               */

#define RTC_INIT_INIT_Pos                (1)                                               /*!< RTC_T::INIT: INIT Position             */
#define RTC_INIT_INIT_Msk                (0x7ffffffful << RTC_INIT_INIT_Pos)               /*!< RTC_T::INIT: INIT Mask                 */

#define RTC_RWEN_RWENPASSWD_Pos          (0)                                               /*!< RTC_T::RWEN: RWENPASSWD Position       */
#define RTC_RWEN_RWENPASSWD_Msk          (0xfffful << RTC_RWEN_RWENPASSWD_Pos)             /*!< RTC_T::RWEN: RWENPASSWD Mask           */

#define RTC_RWEN_RWENF_Pos               (16)                                              /*!< RTC_T::RWEN: RWENF Position            */
#define RTC_RWEN_RWENF_Msk               (0x1ul << RTC_RWEN_RWENF_Pos)                     /*!< RTC_T::RWEN: RWENF Mask                */

#define RTC_FREQADJ_FRACTION_Pos         (0)                                               /*!< RTC_T::FREQADJ: FRACTION Position      */
#define RTC_FREQADJ_FRACTION_Msk         (0x3ful << RTC_FREQADJ_FRACTION_Pos)              /*!< RTC_T::FREQADJ: FRACTION Mask          */

#define RTC_FREQADJ_INTEGER_Pos          (8)                                               /*!< RTC_T::FREQADJ: INTEGER Position       */
#define RTC_FREQADJ_INTEGER_Msk          (0xful << RTC_FREQADJ_INTEGER_Pos)                /*!< RTC_T::FREQADJ: INTEGER Mask           */

#define RTC_TIME_SECOND_Pos              (0)                                               /*!< RTC_T::TIME: SECOND Position           */
#define RTC_TIME_SECOND_Msk              (0xful << RTC_TIME_SECOND_Pos)                    /*!< RTC_T::TIME: SECOND Mask               */

#define RTC_TIME_TENSECOND_Pos           (4)                                               /*!< RTC_T::TIME: TENSECOND Position        */
#define RTC_TIME_TENSECOND_Msk           (0x7ul << RTC_TIME_TENSECOND_Pos)                 /*!< RTC_T::TIME: TENSECOND Mask            */

