yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/rtc_reg.h
#define RTC_TIME_MINUTE_Pos              (8)                                               /*!< RTC_T::TIME: MINUTE Position           */
#define RTC_TIME_MINUTE_Msk              (0xful << RTC_TIME_MINUTE_Pos)                    /*!< RTC_T::TIME: MINUTE Mask               */

#define RTC_TIME_TENMINUTE_Pos           (12)                                              /*!< RTC_T::TIME: TENMINUTE Position        */
#define RTC_TIME_TENMINUTE_Msk           (0x7ul << RTC_TIME_TENMINUTE_Pos)                 /*!< RTC_T::TIME: TENMINUTE Mask            */

#define RTC_TIME_HOUR_Pos                (16)                                              /*!< RTC_T::TIME: HOUR Position             */
#define RTC_TIME_HOUR_Msk                (0xful << RTC_TIME_HOUR_Pos)                      /*!< RTC_T::TIME: HOUR Mask                 */

#define RTC_TIME_TENHOUR_Pos             (20)                                              /*!< RTC_T::TIME: TENHOUR Position          */
#define RTC_TIME_TENHOUR_Msk             (0x3ul << RTC_TIME_TENHOUR_Pos)                   /*!< RTC_T::TIME: TENHOUR Mask              */

#define RTC_CAL_DAY_Pos                  (0)                                               /*!< RTC_T::CAL: DAY Position               */
#define RTC_CAL_DAY_Msk                  (0xful << RTC_CAL_DAY_Pos)                        /*!< RTC_T::CAL: DAY Mask                   */

#define RTC_CAL_TENDAY_Pos               (4)                                               /*!< RTC_T::CAL: TENDAY Position            */
#define RTC_CAL_TENDAY_Msk               (0x3ul << RTC_CAL_TENDAY_Pos)                     /*!< RTC_T::CAL: TENDAY Mask                */

#define RTC_CAL_MONTH_Pos                (8)                                               /*!< RTC_T::CAL: MONTH Position             */
#define RTC_CAL_MONTH_Msk                (0xful << RTC_CAL_MONTH_Pos)                      /*!< RTC_T::CAL: MONTH Mask                 */

#define RTC_CAL_TENMONTH_Pos             (12)                                              /*!< RTC_T::CAL: TENMONTH Position          */
#define RTC_CAL_TENMONTH_Msk             (0x1ul << RTC_CAL_TENMONTH_Pos)                   /*!< RTC_T::CAL: TENMONTH Mask              */

#define RTC_CAL_YEAR_Pos                 (16)                                              /*!< RTC_T::CAL: YEAR Position              */
#define RTC_CAL_YEAR_Msk                 (0xful << RTC_CAL_YEAR_Pos)                       /*!< RTC_T::CAL: YEAR Mask                  */

#define RTC_CAL_TENYEAR_Pos              (20)                                              /*!< RTC_T::CAL: TENYEAR Position           */
#define RTC_CAL_TENYEAR_Msk              (0xful << RTC_CAL_TENYEAR_Pos)                    /*!< RTC_T::CAL: TENYEAR Mask               */

#define RTC_TIMEFMT_24HEN_Pos            (0)                                               /*!< RTC_T::TIMEFMT: 24HEN Position         */
#define RTC_TIMEFMT_24HEN_Msk            (0x1ul << RTC_TIMEFMT_24HEN_Pos)                  /*!< RTC_T::TIMEFMT: 24HEN Mask             */

#define RTC_WEEKDAY_WEEKDAY_Pos          (0)                                               /*!< RTC_T::WEEKDAY: WEEKDAY Position       */
#define RTC_WEEKDAY_WEEKDAY_Msk          (0x7ul << RTC_WEEKDAY_WEEKDAY_Pos)                /*!< RTC_T::WEEKDAY: WEEKDAY Mask           */

#define RTC_TALM_SECOND_Pos              (0)                                               /*!< RTC_T::TALM: SECOND Position           */
#define RTC_TALM_SECOND_Msk              (0xful << RTC_TALM_SECOND_Pos)                    /*!< RTC_T::TALM: SECOND Mask               */

#define RTC_TALM_TENSECOND_Pos           (4)                                               /*!< RTC_T::TALM: TENSECOND Position        */
#define RTC_TALM_TENSECOND_Msk           (0x7ul << RTC_TALM_TENSECOND_Pos)                 /*!< RTC_T::TALM: TENSECOND Mask            */

#define RTC_TALM_MINUTE_Pos              (8)                                               /*!< RTC_T::TALM: MINUTE Position           */
#define RTC_TALM_MINUTE_Msk              (0xful << RTC_TALM_MINUTE_Pos)                    /*!< RTC_T::TALM: MINUTE Mask               */

#define RTC_TALM_TENMINUTE_Pos           (12)                                              /*!< RTC_T::TALM: TENMINUTE Position        */
#define RTC_TALM_TENMINUTE_Msk           (0x7ul << RTC_TALM_TENMINUTE_Pos)                 /*!< RTC_T::TALM: TENMINUTE Mask            */

#define RTC_TALM_HOUR_Pos                (16)                                              /*!< RTC_T::TALM: HOUR Position             */
#define RTC_TALM_HOUR_Msk                (0xful << RTC_TALM_HOUR_Pos)                      /*!< RTC_T::TALM: HOUR Mask                 */

#define RTC_TALM_TENHOUR_Pos             (20)                                              /*!< RTC_T::TALM: TENHOUR Position          */
#define RTC_TALM_TENHOUR_Msk             (0x3ul << RTC_TALM_TENHOUR_Pos)                   /*!< RTC_T::TALM: TENHOUR Mask              */

#define RTC_TALM_SECALM_MSK_Pos          (28)                                              /*!< RTC_T::TALM: SECALM_MSK Position       */
#define RTC_TALM_SECALM_MSK_Msk          (0x1ul << RTC_TALM_SECALM_MSK_Pos)                /*!< RTC_T::TALM: SECALM_MSK Mask           */

#define RTC_TALM_MINALM_MSK_Pos          (29)                                              /*!< RTC_T::TALM: MINALM_MSK Position       */
#define RTC_TALM_MINALM_MSK_Msk          (0x1ul << RTC_TALM_MINALM_MSK_Pos)                /*!< RTC_T::TALM: MINALM_MSK Mask           */

#define RTC_TALM_HRALM_MSK_Pos           (30)                                              /*!< RTC_T::TALM: HRALM_MSK Position        */
#define RTC_TALM_HRALM_MSK_Msk           (0x1ul << RTC_TALM_HRALM_MSK_Pos)                 /*!< RTC_T::TALM: HRALM_MSK Mask            */

#define RTC_CALM_DAY_Pos                 (0)                                               /*!< RTC_T::CALM: DAY Position              */
#define RTC_CALM_DAY_Msk                 (0xful << RTC_CALM_DAY_Pos)                       /*!< RTC_T::CALM: DAY Mask                  */

#define RTC_CALM_TENDAY_Pos              (4)                                               /*!< RTC_T::CALM: TENDAY Position           */
#define RTC_CALM_TENDAY_Msk              (0x3ul << RTC_CALM_TENDAY_Pos)                    /*!< RTC_T::CALM: TENDAY Mask               */

