yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/rtc_reg.h
#define RTC_CALM_MONTH_Pos               (8)                                               /*!< RTC_T::CALM: MONTH Position            */
#define RTC_CALM_MONTH_Msk               (0xful << RTC_CALM_MONTH_Pos)                     /*!< RTC_T::CALM: MONTH Mask                */

#define RTC_CALM_TENMONTH_Pos            (12)                                              /*!< RTC_T::CALM: TENMONTH Position         */
#define RTC_CALM_TENMONTH_Msk            (0x1ul << RTC_CALM_TENMONTH_Pos)                  /*!< RTC_T::CALM: TENMONTH Mask             */

#define RTC_CALM_YEAR_Pos                (16)                                              /*!< RTC_T::CALM: YEAR Position             */
#define RTC_CALM_YEAR_Msk                (0xful << RTC_CALM_YEAR_Pos)                      /*!< RTC_T::CALM: YEAR Mask                 */

#define RTC_CALM_TENYEAR_Pos             (20)                                              /*!< RTC_T::CALM: TENYEAR Position          */
#define RTC_CALM_TENYEAR_Msk             (0xful << RTC_CALM_TENYEAR_Pos)                   /*!< RTC_T::CALM: TENYEAR Mask              */

#define RTC_CALM_WEEKDAY_Pos             (24)                                              /*!< RTC_T::CALM: WEEKDAY Position          */
#define RTC_CALM_WEEKDAY_Msk             (0x7ul << RTC_CALM_WEEKDAY_Pos)                   /*!< RTC_T::CALM: WEEKDAY Mask              */

#define RTC_CALM_DAYALM_MSK_Pos          (28)                                              /*!< RTC_T::CALM: DAYALM_MSK Position       */
#define RTC_CALM_DAYALM_MSK_Msk          (0x1ul << RTC_CALM_DAYALM_MSK_Pos)                /*!< RTC_T::CALM: DAYALM_MSK Mask           */

#define RTC_CALM_MONALM_MSK_Pos          (29)                                              /*!< RTC_T::CALM: MONALM_MSK Position       */
#define RTC_CALM_MONALM_MSK_Msk          (0x1ul << RTC_CALM_MONALM_MSK_Pos)                /*!< RTC_T::CALM: MONALM_MSK Mask           */

#define RTC_CALM_YRALM_MSK_Pos           (30)                                              /*!< RTC_T::CALM: YRALM_MSK Position        */
#define RTC_CALM_YRALM_MSK_Msk           (0x1ul << RTC_CALM_YRALM_MSK_Pos)                 /*!< RTC_T::CALM: YRALM_MSK Mask            */

#define RTC_CALM_WKDALM_MSK_Pos          (31)                                              /*!< RTC_T::CALM: WKDALM_MSK Position       */
#define RTC_CALM_WKDALM_MSK_Msk          (0x1ul << RTC_CALM_WKDALM_MSK_Pos)                /*!< RTC_T::CALM: WKDALM_MSK Mask           */

#define RTC_LEAPYEAR_LEAPYEAR_Pos        (0)                                               /*!< RTC_T::LEAPYEAR: LEAPYEAR Position     */
#define RTC_LEAPYEAR_LEAPYEAR_Msk        (0x1ul << RTC_LEAPYEAR_LEAPYEAR_Pos)              /*!< RTC_T::LEAPYEAR: LEAPYEAR Mask         */

#define RTC_INTEN_ALMIEN_Pos             (0)                                               /*!< RTC_T::INTEN: ALMIEN Position          */
#define RTC_INTEN_ALMIEN_Msk             (0x1ul << RTC_INTEN_ALMIEN_Pos)                   /*!< RTC_T::INTEN: ALMIEN Mask              */

#define RTC_INTEN_TICKIEN_Pos            (1)                                               /*!< RTC_T::INTEN: TICKIEN Position         */
#define RTC_INTEN_TICKIEN_Msk            (0x1ul << RTC_INTEN_TICKIEN_Pos)                  /*!< RTC_T::INTEN: TICKIEN Mask             */

#define RTC_INTEN_RELALMIEN_Pos          (4)                                               /*!< RTC_T::INTEN: RELALMIEN Position       */
#define RTC_INTEN_RELALMIEN_Msk          (0x1ul << RTC_INTEN_RELALMIEN_Pos)                /*!< RTC_T::INTEN: RELALMIEN Mask           */

#define RTC_INTSTS_ALMINT_Pos            (0)                                               /*!< RTC_T::INTSTS: ALMINT Position         */
#define RTC_INTSTS_ALMINT_Msk            (0x1ul << RTC_INTSTS_ALMINT_Pos)                  /*!< RTC_T::INTSTS: ALMINT Mask             */

#define RTC_INTSTS_TICKINT_Pos           (1)                                               /*!< RTC_T::INTSTS: TICKINT Position        */
#define RTC_INTSTS_TICKINT_Msk           (0x1ul << RTC_INTSTS_TICKINT_Pos)                 /*!< RTC_T::INTSTS: TICKINT Mask            */

#define RTC_INTSTS_WAKEUPINT_Pos         (2)                                               /*!< RTC_T::INTSTS: WAKEUPINT Position      */
#define RTC_INTSTS_WAKEUPINT_Msk         (0x1ul << RTC_INTSTS_WAKEUPINT_Pos)               /*!< RTC_T::INTSTS: WAKEUPINT Mask          */

#define RTC_INTSTS_RELALMINT_Pos         (4)                                               /*!< RTC_T::INTSTS: RELALMINT Position      */
#define RTC_INTSTS_RELALMINT_Msk         (0x1ul << RTC_INTSTS_RELALMINT_Pos)               /*!< RTC_T::INTSTS: RELALMINT Mask          */

#define RTC_INTSTS_REGWRBUSY_Pos         (31)                                              /*!< RTC_T::INTSTS: REGWRBUSY Position      */
#define RTC_INTSTS_REGWRBUSY_Msk         (0x1ul << RTC_INTSTS_REGWRBUSY_Pos)               /*!< RTC_T::INTSTS: REGWRBUSY Mask          */

#define RTC_TICK_TTR_Pos                 (0)                                               /*!< RTC_T::TICK: TTR Position              */
#define RTC_TICK_TTR_Msk                 (0x7ul << RTC_TICK_TTR_Pos)                       /*!< RTC_T::TICK: TTR Mask                  */

#define RTC_PWRCTL_ALM_EN_Pos            (3)                                               /*!< RTC_T::PWRCTL: ALM_EN Position         */
#define RTC_PWRCTL_ALM_EN_Msk            (0x1ul << RTC_PWRCTL_ALM_EN_Pos)                  /*!< RTC_T::PWRCTL: ALM_EN Mask             */

#define RTC_PWRCTL_RELALM_EN_Pos         (4)                                               /*!< RTC_T::PWRCTL: RELALM_EN Position      */
#define RTC_PWRCTL_RELALM_EN_Msk         (0x1ul << RTC_PWRCTL_RELALM_EN_Pos)               /*!< RTC_T::PWRCTL: RELALM_EN Mask          */

#define RTC_PWRCTL_RELALM_TIME_Pos       (16)                                              /*!< RTC_T::PWRCTL: RELALM_TIME Position    */
#define RTC_PWRCTL_RELALM_TIME_Msk       (0xffful << RTC_PWRCTL_RELALM_TIME_Pos)           /*!< RTC_T::PWRCTL: RELALM_TIME Mask        */

