yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/rtc_reg.h
#define RTC_PWRCNT_RELALM_CNT_Pos        (0)                                               /*!< RTC_T::PWRCNT: RELALM_CNT Position     */
#define RTC_PWRCNT_RELALM_CNT_Msk        (0xffful << RTC_PWRCNT_RELALM_CNT_Pos)            /*!< RTC_T::PWRCNT: RELALM_CNT Mask         */

#define RTC_CLKCTL_CLKEN_Pos             (0)                                               /*!< RTC_T::CLKCTL: CLKEN Position          */
#define RTC_CLKCTL_CLKEN_Msk             (0x1ul << RTC_CLKCTL_CLKEN_Pos)                   /*!< RTC_T::CLKCTL: CLKEN Mask              */

#define RTC_CLKCTL_CLKMOD_Pos            (1)                                               /*!< RTC_T::CLKCTL: CLKMOD Position         */
#define RTC_CLKCTL_CLKMOD_Msk            (0x1ul << RTC_CLKCTL_CLKMOD_Pos)                  /*!< RTC_T::CLKCTL: CLKMOD Mask             */

#define RTC_SPR0_DATA_Pos                (0)                                               /*!< RTC_T::SPR0: DATA Position             */
#define RTC_SPR0_DATA_Msk                (0xfffffffful << RTC_SPR0_DATA_Pos)               /*!< RTC_T::SPR0: DATA Mask                 */

#define RTC_SPR1_DATA_Pos                (0)                                               /*!< RTC_T::SPR1: DATA Position             */
#define RTC_SPR1_DATA_Msk                (0xfffffffful << RTC_SPR1_DATA_Pos)               /*!< RTC_T::SPR1: DATA Mask                 */

#define RTC_SPR2_DATA_Pos                (0)                                               /*!< RTC_T::SPR2: DATA Position             */
#define RTC_SPR2_DATA_Msk                (0xfffffffful << RTC_SPR2_DATA_Pos)               /*!< RTC_T::SPR2: DATA Mask                 */

#define RTC_SPR3_DATA_Pos                (0)                                               /*!< RTC_T::SPR3: DATA Position             */
#define RTC_SPR3_DATA_Msk                (0xfffffffful << RTC_SPR3_DATA_Pos)               /*!< RTC_T::SPR3: DATA Mask                 */

#define RTC_SPR4_DATA_Pos                (0)                                               /*!< RTC_T::SPR4: DATA Position             */
#define RTC_SPR4_DATA_Msk                (0xfffffffful << RTC_SPR4_DATA_Pos)               /*!< RTC_T::SPR4: DATA Mask                 */

#define RTC_SPR5_DATA_Pos                (0)                                               /*!< RTC_T::SPR5: DATA Position             */
#define RTC_SPR5_DATA_Msk                (0xfffffffful << RTC_SPR5_DATA_Pos)               /*!< RTC_T::SPR5: DATA Mask                 */

#define RTC_SPR6_DATA_Pos                (0)                                               /*!< RTC_T::SPR6: DATA Position             */
#define RTC_SPR6_DATA_Msk                (0xfffffffful << RTC_SPR6_DATA_Pos)               /*!< RTC_T::SPR6: DATA Mask                 */

#define RTC_SPR7_DATA_Pos                (0)                                               /*!< RTC_T::SPR7: DATA Position             */
#define RTC_SPR7_DATA_Msk                (0xfffffffful << RTC_SPR7_DATA_Pos)               /*!< RTC_T::SPR7: DATA Mask                 */

#define RTC_SPR8_DATA_Pos                (0)                                               /*!< RTC_T::SPR8: DATA Position             */
#define RTC_SPR8_DATA_Msk                (0xfffffffful << RTC_SPR8_DATA_Pos)               /*!< RTC_T::SPR8: DATA Mask                 */

#define RTC_SPR9_DATA_Pos                (0)                                               /*!< RTC_T::SPR9: DATA Position             */
#define RTC_SPR9_DATA_Msk                (0xfffffffful << RTC_SPR9_DATA_Pos)               /*!< RTC_T::SPR9: DATA Mask                 */

#define RTC_SPR10_DATA_Pos               (0)                                               /*!< RTC_T::SPR10: DATA Position            */
#define RTC_SPR10_DATA_Msk               (0xfffffffful << RTC_SPR10_DATA_Pos)              /*!< RTC_T::SPR10: DATA Mask                */

#define RTC_SPR11_DATA_Pos               (0)                                               /*!< RTC_T::SPR11: DATA Position            */
#define RTC_SPR11_DATA_Msk               (0xfffffffful << RTC_SPR11_DATA_Pos)              /*!< RTC_T::SPR11: DATA Mask                */

#define RTC_SPR12_DATA_Pos               (0)                                               /*!< RTC_T::SPR12: DATA Position            */
#define RTC_SPR12_DATA_Msk               (0xfffffffful << RTC_SPR12_DATA_Pos)              /*!< RTC_T::SPR12: DATA Mask                */

#define RTC_SPR13_DATA_Pos               (0)                                               /*!< RTC_T::SPR13: DATA Position            */
#define RTC_SPR13_DATA_Msk               (0xfffffffful << RTC_SPR13_DATA_Pos)              /*!< RTC_T::SPR13: DATA Mask                */

#define RTC_SPR14_DATA_Pos               (0)                                               /*!< RTC_T::SPR14: DATA Position            */
#define RTC_SPR14_DATA_Msk               (0xfffffffful << RTC_SPR14_DATA_Pos)              /*!< RTC_T::SPR14: DATA Mask                */

#define RTC_SPR15_DATA_Pos               (0)                                               /*!< RTC_T::SPR15: DATA Position            */
#define RTC_SPR15_DATA_Msk               (0xfffffffful << RTC_SPR15_DATA_Pos)              /*!< RTC_T::SPR15: DATA Mask                */

/**@}*/ /* RTC_CONST */
/**@}*/ /* end of RTC register group */

/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __RTC_REG_H__ */